-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/elizabeth/Documents/GitHub/East_Simon/logs/summtab1_.log
  log type:  text
 opened on:  22 Jul 2024, 12:08:53

. 
. 
. * column 1 : All job losers 
. sum earn age female hisp white black other lesshs hs somecol college married kids_m0  if 
>  head_spouse_partner==1 & month_reljl==-4 & age_sm0>=25 & age_sm0<=54 & templayoff_pre~=1
>  & loser==1 [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |   7,397  26738087.8    4132.554   4732.297  -1705.132   72955.32
         age |   7,397  26738087.8    40.66557   8.447467         25         59
      female |   7,397  26738087.8    .4685616   .4990444          0          1
        hisp |   7,397  26738087.8    .1771882   .3818537          0          1
       white |   7,397  26738087.8    .6407381   .4798165          0          1
-------------+-----------------------------------------------------------------
       black |   7,397  26738087.8     .122753   .3281756          0          1
       other |   7,397  26738087.8    .0593208     .23624          0          1
      lesshs |   7,397  26738087.8    .1254163   .3312127          0          1
          hs |   7,397  26738087.8    .4721565   .4992579          0          1
     somecol |   7,397  26738087.8    .1779261   .3824764          0          1
-------------+-----------------------------------------------------------------
     college |   7,397  26738087.8    .2245012   .4172816          0          1
     married |   7,397  26738087.8    .6363648   .4810779          0          1
     kids_m0 |   7,397  26738087.8     1.03497   1.185553          0          4

. 
. *column 2: job losers with tenure               
. sum earn age female hisp white black other lesshs hs somecol college married kids_m0  if 
> tenure_1year==1 & head_spouse_partner==1  & month_reljl==-4 & age_sm0>=25 & age_sm0<=54  
> & templayoff_pre~=1 & loser==1 [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |   4,947  18220128.9    4773.234   5001.605  -534.4381   72955.32
         age |   4,947  18220128.9    41.29001   8.362882         25         59
      female |   4,947  18220128.9     .461086   .4985338          0          1
        hisp |   4,947  18220128.9    .1678047   .3737305          0          1
       white |   4,947  18220128.9    .6540214   .4757343          0          1
-------------+-----------------------------------------------------------------
       black |   4,947  18220128.9    .1188324   .3236239          0          1
       other |   4,947  18220128.9    .0593416   .2362868          0          1
      lesshs |   4,947  18220128.9    .1079192   .3103097          0          1
          hs |   4,947  18220128.9    .4658385    .498882          0          1
     somecol |   4,947  18220128.9    .1744638   .3795462          0          1
-------------+-----------------------------------------------------------------
     college |   4,947  18220128.9    .2517785   .4340785          0          1
     married |   4,947  18220128.9    .6577863   .4744987          0          1
     kids_m0 |   4,947  18220128.9    .9958219   1.159396          0          4

. 
. *column 3: All workers 
. sum  earn age female hisp white black other lesshs hs somecol college married kids_sm0  i
> f  head_spouse_partner==1 & wave==1 & refmth==1 & age_sm0>=25 & age_sm0<=54 & templayoff_
> pre~=1  [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn | 146,924   412945403    4681.782   6342.034  -39920.47   135367.5
         age | 146,924   412945403    39.95374   8.259989         25         54
      female | 146,924   412945403    .5241711   .4994171          0          1
        hisp | 146,924   412945403      .12163   .3268591          0          1
       white | 146,924   412945403    .7162417   .4508225          0          1
-------------+-----------------------------------------------------------------
       black | 146,924   412945403     .106236   .3081404          0          1
       other | 146,924   412945403    .0558923   .2297144          0          1
      lesshs | 146,924   412945403    .0938158   .2915733          0          1
          hs | 146,924   412945403    .4414023   .4965561          0          1
     somecol | 146,924   412945403    .1666189   .3726365          0          1
-------------+-----------------------------------------------------------------
     college | 146,924   412945403     .298163    .457453          0          1
     married | 146,924   412945403    .7041822   .4564111          0          1
    kids_sm0 | 146,924   412945403    1.042853   1.158808          0          4

.         
. *column 4: all workers with tenure: 
. sum  earn age female hisp white black other lesshs hs somecol college married kids_sm0  i
> f tenure_1year2==1 & head_spouse_partner==1  & wave==1 & refmth==1 & age_sm0>=25 & age_sm
> 0<=54 & templayoff_pre~=1  [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |  84,943   240740795    5963.112   5810.298  -14145.04   125276.7
         age |  84,943   240740795    40.32625   8.123534         25         54
      female |  84,943   240740795    .4844485    .499761          0          1
        hisp |  84,943   240740795    .1086728   .3112301          0          1
       white |  84,943   240740795    .7363276   .4406263          0          1
-------------+-----------------------------------------------------------------
       black |  84,943   240740795    .1046305   .3060785          0          1
       other |  84,943   240740795    .0503692   .2187068          0          1
      lesshs |  84,943   240740795    .0651603   .2468099          0          1
          hs |  84,943   240740795     .434693   .4957196          0          1
     somecol |  84,943   240740795    .1726862    .377978          0          1
-------------+-----------------------------------------------------------------
     college |  84,943   240740795    .3274605   .4692896          0          1
     married |  84,943   240740795    .7143688   .4517172          0          1
    kids_sm0 |  84,943   240740795    .9875725   1.115523          0          4

. ***********************************
. 
. ***************************************
. *** Save Dataset for Control *******
. ***************************************
. preserve

.         
. keep if loser==0
(703,996 observations deleted)

. save "$samples/controlsetup.dta", replace
file /Users/elizabeth/Dropbox/child SIPP
    longterm/analysis/samples/JobLosers_SafetyNet/controlsetup.dta saved

.         
