---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/elizabeth/Documents/GitHub/East_Simon/logs/summtab1_.log
  log type:  text
 opened on:  23 Jul 2024, 09:58:39

. 
. 
. * column 1 : All job losers 
. sum earn age female hisp white black other lesshs hs somecol college married kids_m0  if  h
> ead_spouse_partner==1 & month_reljl==-4 & age_sm0>=25 & age_sm0<=54 & templayoff_pre~=1 & l
> oser==1 [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |   7,397  26738087.8    4132.554   4732.297  -1705.132   72955.32
         age |   7,397  26738087.8    40.66557   8.447467         25         59
      female |   7,397  26738087.8    .4685616   .4990444          0          1
        hisp |   7,397  26738087.8    .1771882   .3818537          0          1
       white |   7,397  26738087.8    .6407381   .4798165          0          1
-------------+-----------------------------------------------------------------
       black |   7,397  26738087.8     .122753   .3281756          0          1
       other |   7,397  26738087.8    .0593208     .23624          0          1
      lesshs |   7,397  26738087.8    .1254163   .3312127          0          1
          hs |   7,397  26738087.8    .4721565   .4992579          0          1
     somecol |   7,397  26738087.8    .1779261   .3824764          0          1
-------------+-----------------------------------------------------------------
     college |   7,397  26738087.8    .2245012   .4172816          0          1
     married |   7,397  26738087.8    .6363648   .4810779          0          1
     kids_m0 |   7,397  26738087.8     1.03497   1.185553          0          4

. 
. *column 2: job losers with tenure               
. sum earn age female hisp white black other lesshs hs somecol college married kids_m0  if te
> nure_1year==1 & head_spouse_partner==1  & month_reljl==-4 & age_sm0>=25 & age_sm0<=54  & te
> mplayoff_pre~=1 & loser==1 [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |   4,947  18220128.9    4773.234   5001.605  -534.4381   72955.32
         age |   4,947  18220128.9    41.29001   8.362882         25         59
      female |   4,947  18220128.9     .461086   .4985338          0          1
        hisp |   4,947  18220128.9    .1678047   .3737305          0          1
       white |   4,947  18220128.9    .6540214   .4757343          0          1
-------------+-----------------------------------------------------------------
       black |   4,947  18220128.9    .1188324   .3236239          0          1
       other |   4,947  18220128.9    .0593416   .2362868          0          1
      lesshs |   4,947  18220128.9    .1079192   .3103097          0          1
          hs |   4,947  18220128.9    .4658385    .498882          0          1
     somecol |   4,947  18220128.9    .1744638   .3795462          0          1
-------------+-----------------------------------------------------------------
     college |   4,947  18220128.9    .2517785   .4340785          0          1
     married |   4,947  18220128.9    .6577863   .4744987          0          1
     kids_m0 |   4,947  18220128.9    .9958219   1.159396          0          4

. 
. *column 3: All workers 
. sum  earn age female hisp white black other lesshs hs somecol college married kids_sm0  if 
>  head_spouse_partner==1 & wave==1 & refmth==1 & age_sm0>=25 & age_sm0<=54 & templayoff_pre~
> =1  [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn | 146,924   412945403    4681.782   6342.034  -39920.47   135367.5
         age | 146,924   412945403    39.95374   8.259989         25         54
      female | 146,924   412945403    .5241711   .4994171          0          1
        hisp | 146,924   412945403      .12163   .3268591          0          1
       white | 146,924   412945403    .7162417   .4508225          0          1
-------------+-----------------------------------------------------------------
       black | 146,924   412945403     .106236   .3081404          0          1
       other | 146,924   412945403    .0558923   .2297144          0          1
      lesshs | 146,924   412945403    .0938158   .2915733          0          1
          hs | 146,924   412945403    .4414023   .4965561          0          1
     somecol | 146,924   412945403    .1666189   .3726365          0          1
-------------+-----------------------------------------------------------------
     college | 146,924   412945403     .298163    .457453          0          1
     married | 146,924   412945403    .7041822   .4564111          0          1
    kids_sm0 | 146,924   412945403    1.042853   1.158808          0          4

.         
. *column 4: all workers with tenure: 
. sum  earn age female hisp white black other lesshs hs somecol college married kids_sm0  if 
> tenure_1year2==1 & head_spouse_partner==1  & wave==1 & refmth==1 & age_sm0>=25 & age_sm0<=5
> 4 & templayoff_pre~=1  [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |  84,943   240740795    5963.112   5810.298  -14145.04   125276.7
         age |  84,943   240740795    40.32625   8.123534         25         54
      female |  84,943   240740795    .4844485    .499761          0          1
        hisp |  84,943   240740795    .1086728   .3112301          0          1
       white |  84,943   240740795    .7363276   .4406263          0          1
-------------+-----------------------------------------------------------------
       black |  84,943   240740795    .1046305   .3060785          0          1
       other |  84,943   240740795    .0503692   .2187068          0          1
      lesshs |  84,943   240740795    .0651603   .2468099          0          1
          hs |  84,943   240740795     .434693   .4957196          0          1
     somecol |  84,943   240740795    .1726862    .377978          0          1
-------------+-----------------------------------------------------------------
     college |  84,943   240740795    .3274605   .4692896          0          1
     married |  84,943   240740795    .7143688   .4517172          0          1
    kids_sm0 |  84,943   240740795    .9875725   1.115523          0          4

. ***********************************
. 
. ***************************************
. *** Save Dataset for Control *******
. ***************************************
. preserve

.         
. keep if loser==0
(703,996 observations deleted)

. save "$samples/controlsetup.dta", replace
file /Users/elizabeth/Dropbox/child SIPP
    longterm/analysis/samples/JobLosers_SafetyNet/controlsetup.dta saved

.         
. restore

. 
. keep if loser==1
(8,528,792 observations deleted)

. 
. ***************************************
. ** Program Participation Variables
. ***************************************
. for any ss_amt ssi_amt h_ss_amt h_ssi_amt h_wic_amt uiamt h_fs_amt h_tanf_amt sevrpay enrgy
> amt: gen d_X=(X>0 & X~=.)

->  gen d_ss_amt=(ss_amt>0 & ss_amt~=.)

->  gen d_ssi_amt=(ssi_amt>0 & ssi_amt~=.)

->  gen d_h_ss_amt=(h_ss_amt>0 & h_ss_amt~=.)

->  gen d_h_ssi_amt=(h_ssi_amt>0 & h_ssi_amt~=.)

->  gen d_h_wic_amt=(h_wic_amt>0 & h_wic_amt~=.)

->  gen d_uiamt=(uiamt>0 & uiamt~=.)

->  gen d_h_fs_amt=(h_fs_amt>0 & h_fs_amt~=.)

->  gen d_h_tanf_amt=(h_tanf_amt>0 & h_tanf_amt~=.)

->  gen d_sevrpay=(sevrpay>0 & sevrpay~=.)

->  gen d_enrgyamt=(enrgyamt>0 & enrgyamt~=.)

. for any ss_amt ssi_amt h_ss_amt h_ssi_amt h_wic_amt uiamt h_fs_amt h_tanf_amt sevrpay enrgy
> amt: replace d_X=. if X==.

->  replace d_ss_amt=. if ss_amt==.
(0 real changes made)

->  replace d_ssi_amt=. if ssi_amt==.
(0 real changes made)

->  replace d_h_ss_amt=. if h_ss_amt==.
(0 real changes made)

->  replace d_h_ssi_amt=. if h_ssi_amt==.
(0 real changes made)

->  replace d_h_wic_amt=. if h_wic_amt==.
(0 real changes made)

->  replace d_uiamt=. if uiamt==.
(0 real changes made)

->  replace d_h_fs_amt=. if h_fs_amt==.
(0 real changes made)

->  replace d_h_tanf_amt=. if h_tanf_amt==.
(0 real changes made)

->  replace d_sevrpay=. if sevrpay==.
(0 real changes made)

->  replace d_enrgyamt=. if enrgyamt==.
(0 real changes made)

. for any ss_amt ssi_amt h_ss_amt h_ssi_amt h_wic_amt uiamt h_fs_amt h_tanf_amt sevrpay enrgy
> amt: replace d_X=d_X*100

->  replace d_ss_amt=d_ss_amt*100
(18,541 real changes made)

->  replace d_ssi_amt=d_ssi_amt*100
(6,785 real changes made)

->  replace d_h_ss_amt=d_h_ss_amt*100
(95,926 real changes made)

->  replace d_h_ssi_amt=d_h_ssi_amt*100
(30,980 real changes made)

->  replace d_h_wic_amt=d_h_wic_amt*100
(59,721 real changes made)

->  replace d_uiamt=d_uiamt*100
(67,624 real changes made)

->  replace d_h_fs_amt=d_h_fs_amt*100
(101,028 real changes made)

->  replace d_h_tanf_amt=d_h_tanf_amt*100
(18,535 real changes made)

->  replace d_sevrpay=d_sevrpay*100
(2,373 real changes made)

->  replace d_enrgyamt=d_enrgyamt*100
(1,820 real changes made)

. replace frp_lunch = frp_lunch*100
(132,803 real changes made)

. 
. ***************************************
. *ever ui receipt
. ***************************************
. sort uniqueid month_reljl

. by uniqueid: egen uismp_temp = max(d_uiamt) if month_reljl>0
(307,698 missing values generated)

. replace uismp_temp = 0 if uismp_temp==.
(307,698 real changes made)

. by uniqueid: egen uismp = max(uismp_temp)

. order uniqueid month_reljl d_uiamt uismp_temp uismp

. replace uismp=1 if uismp==100
(333,401 real changes made)

. drop uismp_temp 

. gen nouismp = (uismp==0)

. 
. 
. *number of job losers by ui
. tab uismp if tenure_1year==1 & head_spouse_partner==1  & month_reljl==-4 & age_sm0>=24 & ag
> e_sm0<=55  & templayoff_pre~=1 & loser==1 , missing 

      uismp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,128       41.19       41.19
          1 |      3,038       58.81      100.00
------------+-----------------------------------
      Total |      5,166      100.00

. 
. 
. * job losers who get ui
. sum earn age female hisp white black other lesshs hs somecol college married kids_m0  hpov1
> 00  if tenure_1year==1 & head_spouse_partner==1  & month_reljl==-4 & age_sm0>=25 & age_sm0<
> =54  & templayoff_pre~=1 & loser==1  & uismp==1 [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |   2,918  10597935.6    4954.723   4499.176          0    64681.5
         age |   2,918  10597935.6    41.70185   8.334035         25         59
      female |   2,918  10597935.6    .4615574   .4986054          0          1
        hisp |   2,918  10597935.6    .1526197   .3596821          0          1
       white |   2,918  10597935.6    .6756131   .4682255          0          1
-------------+-----------------------------------------------------------------
       black |   2,918  10597935.6    .1102701   .3132798          0          1
       other |   2,918  10597935.6    .0614971   .2402811          0          1
      lesshs |   2,918  10597935.6    .0875891   .2827449          0          1
          hs |   2,918  10597935.6    .4596439   .4984541          0          1
     somecol |   2,918  10597935.6    .1873421   .3902528          0          1
-------------+-----------------------------------------------------------------
     college |   2,918  10597935.6    .2654248   .4416348          0          1
     married |   2,918  10597935.6    .6345815   .4816298          0          1
     kids_m0 |   2,918  10597935.6    .9313618   1.125693          0          4
     hpov100 |   2,918  10597935.6    .1958333   .3969088          0          1

.                 
. * job losers who dont get ui
. sum earn age female hisp white black other lesshs hs somecol college married kids_m0 hpov10
> 0 if tenure_1year==1 & head_spouse_partner==1  & month_reljl==-4 & age_sm0>=25 & age_sm0<=5
> 4 & templayoff_pre~=1 & loser==1 & uismp~=1 [aw=p5wgt]

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
        earn |   2,029  7622193.26    4520.889   5617.538  -534.4381   72955.32
         age |   2,029  7622193.26    40.71738   8.371236         25         59
      female |   2,029  7622193.26    .4604305   .4985547          0          1
        hisp |   2,029  7622193.26    .1889179   .3915399          0          1
       white |   2,029  7622193.26    .6240001   .4844994          0          1
-------------+-----------------------------------------------------------------
       black |   2,029  7622193.26    .1307374   .3371961          0          1
       other |   2,029  7622193.26    .0563445   .2306426          0          1
      lesshs |   2,029  7622193.26    .1361863   .3430708          0          1
          hs |   2,029  7622193.26    .4744514   .4994699          0          1
     somecol |   2,029  7622193.26    .1565577   .3634728          0          1
-------------+-----------------------------------------------------------------
     college |   2,029  7622193.26    .2328047    .422723          0          1
     married |   2,029  7622193.26    .6900503   .4625866          0          1
     kids_m0 |   2,029  7622193.26    1.085448    1.19922          0          4
     hpov100 |   2,029  7622193.26    .2882189   .4530452          0          1

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/elizabeth/Documents/GitHub/East_Simon/logs/summtab1_.log
  log type:  text
 closed on:  23 Jul 2024, 10:08:15
---------------------------------------------------------------------------------------------
